[M_Sage_Nakayamarama MissionDefinition]
TurnInDescription="You've learned a little something about Nakayama. Nothing that will actually help you kill him, of course, but still -- something."
MissionSummary="Find Nakayama's lost audio diaries."
TeaserText="Keep your friends close... "
